In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /opt/anaconda3/lib/python3.11/site-packages (8.4.0)

In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import mysql.connector
import pickle

import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [3]:
# Connect to MySQL database
conn = mysql.connector.connect(host='127.0.0.1', user='root', passwd=password)
cursor = conn.cursor()

# Create or select the database
cursor.execute("CREATE DATABASE IF NOT EXISTS vanguard")
cursor.execute("USE vanguard")

In [4]:
def pickle_to_mysql_table(cursor, pickle_file, table_name):
    # Read the interactions from the pickle file
    with open(pickle_file, 'rb') as file:
        interactions = pickle.load(file)

    # Define MySQL table schema based on DataFrame columns
    create_table_query = f"CREATE TABLE IF NOT EXISTS {table_name} ({', '.join([f'{col} VARCHAR(255)' for col in interactions.columns])})"
    cursor.execute(create_table_query)

    # Convert DataFrame to list of dictionaries, handling NaN values
    data = interactions.where((pd.notnull(interactions)), None).to_dict(orient='records')

    # Insert data into MySQL table
    for row in data:
        columns = ', '.join(row.keys())
        values = ', '.join(['%s'] * len(row))
        insert_query = f"INSERT INTO {table_name} ({columns}) VALUES ({values})"
        cursor.execute(insert_query, list(row.values()))

In [5]:
#pickle_to_mysql_table(cursor, clients.pkl, clients)
#pickle_to_mysql_table(cursor, group_id.pkl, group_id)
#pickle_to_mysql_table(cursor, interactions.pkl, interactions)

In [6]:
#with open("data/clients.pkl", 'rb') as file:
    #interactions = pickle.load(file)

In [7]:
group_id = pd.read_csv('https://raw.githubusercontent.com/nessajimenez/vanguard-digital-project/main/Data/df_final_experiment_clients.txt', delimiter='\,')

group_id

/var/folders/jg/z9vz0kpj1t56r_y5t2ghwzxc0000gn/T/ipykernel_70897/2799224499.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  group_id = pd.read_csv('https://raw.githubusercontent.com/nessajimenez/vanguard-digital-project/main/Data/df_final_experiment_clients.txt', delimiter='\,')

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [8]:
# Define MySQL table schema based on DataFrame columns
create_table_query = f"CREATE TABLE IF NOT EXISTS group_id ({', '.join([f'{col} VARCHAR(255)' for col in group_id.columns])})"
cursor.execute(create_table_query)

# Convert DataFrame to list of dictionaries, handling NaN values
data = group_id.where((pd.notnull(group_id)), None).to_dict(orient='records')

# Insert data into MySQL table
for row in data:
    columns = ', '.join(row.keys())
    values = ', '.join(['%s'] * len(row))
    insert_query = f"INSERT INTO group_id ({columns}) VALUES ({values})"
    cursor.execute(insert_query, list(row.values()))

In [9]:
clients = pd.read_csv('https://raw.githubusercontent.com/nessajimenez/vanguard-digital-project/main/Data/df_final_demo.txt', delimiter='\,')

clients

# Define MySQL table schema based on DataFrame columns
create_table_query = f"CREATE TABLE IF NOT EXISTS clients ({', '.join([f'{col} VARCHAR(255)' for col in clients.columns])})"
cursor.execute(create_table_query)

# Convert DataFrame to list of dictionaries, handling NaN values
data = clients.where((pd.notnull(clients)), None).to_dict(orient='records')

# Insert data into MySQL table
for row in data:
    columns = ', '.join(row.keys())
    values = ', '.join(['%s'] * len(row))
    insert_query = f"INSERT INTO clients ({columns}) VALUES ({values})"
    cursor.execute(insert_query, list(row.values()))

/var/folders/jg/z9vz0kpj1t56r_y5t2ghwzxc0000gn/T/ipykernel_70897/2265761918.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  clients = pd.read_csv('https://raw.githubusercontent.com/nessajimenez/vanguard-digital-project/main/Data/df_final_demo.txt', delimiter='\,')

In [11]:
import pickle

# Open the pickle file for reading in binary mode
with open('/Users/danielarivera/Ironhack_Jup_Note/vanguard-digital-project/interactions.pkl', 'rb') as file:
    # Load the data from the pickle file
    data2 = pickle.load(file)

In [14]:
# Define MySQL table schema based on DataFrame columns
create_table_query = f"CREATE TABLE IF NOT EXISTS interactions ({', '.join([f'{col} VARCHAR(255)' for col in data2.columns])})"
cursor.execute(create_table_query)

# Convert DataFrame to list of dictionaries, handling NaN values
data = data2.where((pd.notnull(data2)), None).to_dict(orient='records')

# Insert data into MySQL table
for row in data:
    columns = ', '.join(row.keys())
    values = ', '.join(['%s'] * len(row))
    insert_query = f"INSERT INTO interactions ({columns}) VALUES ({values})"
    cursor.execute(insert_query, list(row.values()))